```
krishna@turbotindias-MacBook-Pro gcp_compute_engine_image_approved_usage % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_computeengine_image_approved will be created
  + resource "turbot_policy_setting" "gcp_computeengine_image_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/imageApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_computeengine_image_approved_usage will be created
  + resource "turbot_policy_setting" "gcp_computeengine_image_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
            {% if $.item.imageId == null %} 
              "Not approved"
            {% else %}
            {% set imageName = $.item.name %}
            {% set imageProject = $.item.imageId.split("projects/")[1].split("/") | first %}
            {% set approvedImageProjectList = [
              'project1',
              'project2'
              ] %}
            {% set approvedImageList  = [
              'image1',
              'image2'
              ] %}
            
            {% if imageProject in approvedImageProjectList and imageName in approvedImageList%}
              "Approved"
            {% else %}
              "Not approved"  
            {% endif %}
            {% endif %}
        EOT
      + template_input               = <<~EOT
            {
                  item: resource {
                    name: get(path: "name")
                    imageId: get(path: "sourceImage")
                  }
            }
        EOT
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/imageApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_computeengine_image will be created
  + resource "turbot_smart_folder" "gcp_computeengine_image" {
      + description = "Restrict Compute Engine Images based on approved image list"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Compute Engine Image Approved"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_computeengine_image: Creating...
turbot_smart_folder.gcp_computeengine_image: Creation complete after 2s [id=217074905598203]
turbot_policy_setting.gcp_computeengine_image_approved: Creating...
turbot_policy_setting.gcp_computeengine_image_approved_usage: Creating...
turbot_policy_setting.gcp_computeengine_image_approved: Creation complete after 2s [id=217074908547334]
turbot_policy_setting.gcp_computeengine_image_approved_usage: Creation complete after 2s [id=217074908194049]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.